app/controllers/accomplishments_controller.rb

  def index
    @accomplishments = Accomplishment.all
---
SELECT * FROM "accomplishments" ORDER BY created_at DESC

  def show
    @accomplishment = Accomplishment.find(params[:id])
---
SELECT * FROM "accomplishments" WHERE ("accomplishments"."id" = 8) ORDER BY created_at DESC

  def edit
    @accomplishment = Accomplishment.find(params[:id])
---
SELECT * FROM "accomplishments" WHERE ("accomplishments"."id" = 8) ORDER BY created_at DESC

  def create
    @accomplishment = Accomplishment.new(params[:accomplishment])

    if @accomplishment.save
---
INSERT INTO "accomplishments" ("created_at", "updated_at", "description") VALUES('2011-12-05 03:23:56', '2011-12-05 03:23:56', 'Attained the rank of Eagle Scout in February 2002')

  def update
    @accomplishment = Accomplishment.find(params[:id])
---
SELECT * FROM "accomplishments" WHERE ("accomplishments"."id" = 8) ORDER BY created_at DESC