app/controllers/projects_controller.rb

  def index
    @projects = admin_login? ? Project.visible.all : Project.active.all
---
SELECT * FROM "projects" WHERE (status in ('active','pending'))

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO "projects" ("created_at", "title", "artwork_content_type", "updated_at", "artwork_updated_at", "artwork_file_name", "artwork_file_size", "description", "status") VALUES('2011-12-13 04:53:02', 'Super Bowl XLIII Head to Head', 'image/jpeg', '2011-12-13 04:53:02', '2011-12-13 04:53:02', 'super.jpg', 99733, '

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(params[:project])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 15)
UPDATE "projects" SET "updated_at" = '2011-12-23 19:38:24', "artwork_file_size" = 60767, "artwork_file_name" = 'cavs.jpg', "artwork_updated_at" = '2011-12-23 19:38:24' WHERE "id" = 72

  def destroy
    @project = Project.find(params[:id])
    @project.update_attribute(:status, "deleted")
---
SELECT * FROM "projects" WHERE ("projects"."id" = 14)
UPDATE "projects" SET "updated_at" = '2011-12-09 05:42:34', "status" = 'deleted' WHERE "id" = 22

  def crop
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 37)

  def publish
    project = Project.find(params[:id])
    project.update_attribute(:status, "active")
---
SELECT * FROM "projects" WHERE ("projects"."id" = 68)
UPDATE "projects" SET "updated_at" = '2011-12-23 20:08:20', "status" = 'pending' WHERE "id" = 68

  def activate
    project = Project.find(params[:id])
    project.update_attribute(:status, "pending")
---
SELECT * FROM "projects" WHERE ("projects"."id" = 50)
UPDATE "projects" SET "updated_at" = '2011-12-23 22:17:11', "status" = 'pending' WHERE "id" = 50