app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "email_address") VALUES('Ben', '528a6ededf657c23678708a333026f821a89c7e0200b8fbb62ce99ea9c144341', 'c8c4745a1b7a6b6ffb3e4c425c61d5d16409673a1188df0f45cf2c4ad681acdb', '2011-12-25 03:21:53', '2011-12-25 03:21:53', 'senorduck@gmail.com')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2011-12-25 04:23:13', "encrypted_password" = '18a05f11f3c71b22eb3106bf872e102bcad4b844146b6f993d8342c7aac57ba8', "salt" = '8320384ff369188b4ef9a27bf174811cfa82a150918eb1ff3c27ed714edd1e30', "name" = 'Benjamin' WHERE "id" = 1